Autodesk.Revit.DB.NumberSystemDisplayRule
The available options for display of numeric values in the number system.
Since:
2013

Autodesk.Revit.DB.NumberSystemDisplayRule.StartAndEnd
The number system will only display the start and end numbers.

Autodesk.Revit.DB.NumberSystemDisplayRule.Even
The number system will only display the even numbers.

Autodesk.Revit.DB.NumberSystemDisplayRule.Odd
The number system will only display the odd numbers.

Autodesk.Revit.DB.NumberSystemDisplayRule.All
The number system will display all the numbers.